# RbsHvacloadDoorAreaParam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsHvacloadDoorAreaParam Property
ParameterTypeId Class See Also
---
"Door Area"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsHvacloadDoorAreaParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsHvacloadDoorAreaParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsHvacloadDoorAreaParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace